Repository: ismoy/ImagePickerKMP
Catalog: library/src/iosMain/resources/*.lproj/Localizable.strings
Languages: fr

source: Camera permission required
fr: Permission d'appareil photo requise

# camera_permission_description
source: Camera permission is required to capture photos. Please grant it in settings
fr: Cette application a besoin d'accéder à votre appareil photo pour prendre des photos

source: Open settings
fr: Ouvrir les paramètres

source: Camera permission denied
fr: Permission d'appareil photo refusée

# camera_permission_denied_description
source: Camera permission is required to capture photos. Please grant the permissions
fr: Pour utiliser cette fonctionnalité, vous devez autoriser l'accès à l'appareil photo dans les paramètres

source: Grant permission
fr: Accorder la permission

source: Camera permission permanently denied
fr: Permission d'appareil photo définitivement refusée

# image_confirmation_title
source: Are you satisfied with the photo?
fr: Confirmer l'image

# accept_button
source: Accept
fr: Accepter

# retry_button
source: Retry
fr: Réessayer

# select_option_dialog_title
source: Select option
fr: Sélectionner une option

# take_photo_option
source: Take photo
fr: Prendre une photo

# select_from_gallery_option
source: Select from gallery
fr: Sélectionner depuis la galerie

# cancel_option
source: Cancel
fr: Annuler

# preview_image_description
source: Preview
fr: Aperçu de l'image capturée

# hd_quality_description
source: HD
fr: Qualité haute définition

# sd_quality_description
source: SD
fr: Qualité standard

# invalid_context_error
source: Invalid context. Must be ComponentActivity
fr: Contexte invalide

# photo_capture_error
source: Photo capture failed
fr: Erreur lors de la capture de la photo

# gallery_selection_error
source: Gallery selection failed
fr: Erreur lors de la sélection depuis la galerie

# permission_error
source: Permission error occurred
fr: Erreur de permission
